#include "CARMSG.h"

/*****************************************************************************
**函数名称:	 CarKey_Detected
**函数功能:	 检测按键
**入口参数:
**返回参数:
******************************************************************************/
void CarKey_Detected(void)
{
	Key_Detected();     //自锁开关扫描
	ADCKey_Detected();	//ADC按键扫描    
}

/*****************************************************************************
**函数名称:	 CarKey_Detected
**函数功能:	 按键检测应用函数
**入口参数:
**返回参数:
******************************************************************************/
void CarKey_Detected_APP(void)
{
    EKey_InfoChange();		//EK检测及其应用函数
    Key_InfoChange();	    //自锁开关检测应用函数
    ADCKey_InfoChange();    //ADC按键检测应用函数
}




